Samsung/TizenRT/os/arch/arm/include/stm32h745/stm32h745xx_irq.h
#define STM32H745_IRQ_WWDG_RST               (STM32H745_IRQ_FIRST + 143)    /*!<Window Watchdog reset interrupt (exti_d2_wwdg_it, exti_d1_wwdg_it) */
#define STM32H745_IRQ_CRS                    (STM32H745_IRQ_FIRST + 144)    /*!< Clock Recovery Global Interrupt                                   */
#define STM32H745_IRQ_ECC                    (STM32H745_IRQ_FIRST + 145)    /*!< ECC diagnostic Global Interrupt                                   */
#define STM32H745_IRQ_SAI4                   (STM32H745_IRQ_FIRST + 146)    /*!< SAI4 global interrupt                                             */
/* Reserved */
#define STM32H745_IRQ_HOLD_CORE              (STM32H745_IRQ_FIRST + 148)    /*!< Hold core interrupt                                               */
#define STM32H745_IRQ_WAKEUP_PIN             (STM32H745_IRQ_FIRST + 149)    /*!< Interrupt for all 6 wake-up pins                                  */

#if defined(CONFIG_STM32H745_STM32H745ZI)
#  define STM32H745_IRQ_NEXTINTS  150
#else
#  error "Unsupported STM32H745 chip"
#endif

/* (EXTI interrupts do not use IRQ numbers) */

#define NR_IRQS                 (STM32H745_IRQ_FIRST + STM32H745_IRQ_NEXTINTS)

/****************************************************************************************************
 * Public Types
 ****************************************************************************************************/

/****************************************************************************************************
 * Public Data
 ****************************************************************************************************/

#ifndef __ASSEMBLY__
#ifdef __cplusplus
#define EXTERN extern "C"
extern "C"
{
#else
#define EXTERN extern
#endif

/****************************************************************************************************
 * Public Functions
 ****************************************************************************************************/

#undef EXTERN
#ifdef __cplusplus
}
#endif
#endif

#endif /* __ARCH_ARM_INCLUDE_STM32H745_STM32H745XX_IRQ_H */
